[
  {
    "id": "lore_001",
    "text": "Etched into a cave wall: 'Beware the one-eyed owl who guards the dusk.'",
    "options": [
      {
        "text": "Poke the owl in the eye",
        "result": "combat",
        "responseText": "The owl's eye snaps open. There is a deep and gravelly growl coming from behind..."
      },
      {
        "text": "Keep walking",
        "result": "none",
        "responseText": "The forest remains silent."
      },
      {
        "text": "Kick the owl in the eye",
        "result": "combat",
        "responseText": "The owl's eye snaps open. There is a deep and gravelly growl coming from behind..."
      },
      {
        "text": "Step away slowly",
        "result": "none",
        "responseText": "The forest remains silent, but you feel the eye glaring at you."
      }
    ]
  },
  {
    "id": "lore_002",
    "text": "There is what looks like a deep, dark pit about 10 feet ahead of you. As you step closer, you can hear the sound of rustling.",
    "options": [
      {
        "text": "Jump in the hole. Fortune favors the bold.",
        "result": "combat",
        "responseText": "...and the bold favor the afterlife."
      },
      {
        "text": "Step around the pit.",
        "result": "none",
        "responseText": "It's too risky. I better keep moving."
      },
      {
        "text": "Demonstrate how dexterous you are by leaping over the pit",
        "result": "damage-minor",
        "responseText": "You jump the gap but land on your ankle and hurt yourself."
      },
      {
        "text": "Throw a rock into the pit.",
        "result": "combat",
        "responseText": "You hear the snarling intensify and see a creature climb up the pit. Before you know it, the creature is in front of you, looking deep into your eyes."
      }
    ]
  },
  {
    "id": "lore_003",
    "text": "There is a glowing herb sprouting from a crack in the rock.",
    "options": [
      {
        "text": "Pick it out of the crack and use it for a glowing herb stew",
        "result": "item",
        "details": "health",
        "responseText": "'This is very good and VERY minty stew.'"
      },
      {
        "text": "Eat it",
        "result": "item",
        "details": "health",
        "responseText": "The herb tastes minty and you gain +5 HP."
      },
      {
        "text": "Leave it alone",
        "result": "none",
        "responseText": "Maybe someone else will need it more."
      },
      {
        "text": "Curse at the glowing herb",
        "result": "none",
        "responseText": "Nothing happens. Do you feel tough?"
      }
    ]
  },
  {
    "id": "lore_004",
    "text": "You have reached a smooth rock overlooking the forest ahead.",
    "options": [
      {
        "text": "Sit at the rock and contemplate your journey so far and plan for the journey ahead.",
        "result": "special",
        "details": "recover",
        "responseText": "I wish I had a beer to crack and some Steely Dan to listen to, but this will do."
      },
      {
        "text": "Throw a middle finger at the rock",
        "result": "none",
        "responseText": "'What an ugly rock.'"
      },
      {
        "text": "Appreciate the rock for what it is and move on.",
        "result": "none",
        "responseText": "'I must continue on.'"
      },
      {
        "text": "Pray upon the rock and thank the Gods for safety and health",
        "result": "item",
        "details": "health",
        "responseText": "The sky grants temporary shade from the sun and you feel comforted."
      }
    ]
  },
  {
    "id": "lore_005",
    "text": "There is a large clearing in the forest that leads to a small lake where the sun's light dances endlessly. There is a small glowing artifact sticking out of the rocks and sand. It seems to shake harder the closer it is to a weapon...",
    "options": [
      {
        "text": "Pick it up and touch it to your weapon",
        "result": "item",
        "details": "weapon",
        "responseText": "The shaking stops, the weapon feels sturdier. Damage base has been increased by 1."
      },
      {
        "text": "Kick the rock into the lake",
        "result": "damage-minor",
        "responseText": "The rock, still shaking, sails into the lake and disappears under the water. Your foot took damage."
      },
      {
        "text": "Eat the rock",
        "result": "none",
        "responseText": "Your stomach shakes and shakes, but nothing substantial happens."
      },
      {
        "text": "Leave it alone",
        "result": "none",
        "responseText": "'I have no use for violently shaking rocks, to be quite honest.'"
      }
    ]
  },
  {
    "id": "lore_006",
    "text": "You find a pile of steel, an anvil, and a kiln all under a lean-to. It appears to be an old blacksmithing site that has since been abandoned. Everything under the lean-to seems to still be in working order.",
    "options": [
      {
        "text": "Use the things under the lean-to on your weapon.",
        "result": "item",
        "details": "weapon",
        "responseText": "I should have been a blacksmith instead of an adventurer. Damage base has been increased by 1."
      },
      {
        "text": "Continue on.",
        "result": "none",
        "responseText": "There are probably bugs and spiders in that mess. No thank you."
      },
      {
        "text": "Start a new town, start a new life.",
        "result": "none",
        "responseText": "You hang up your weapons, your boots, and your armor. You begin chopping trees one by one, create a lean-to against the biggest, closest tree you can find. By day, you chop trees, burn debris, rearrange rocks, and build on existing structures to reinforce their strength. At dusk, you find local game to sustain on: fish, deer, squirrel, wild boar. At night, you contemplate your next move. Should you start building a church to pray to your Gods? Should you start building a more sustainable home to live in? I bet down the road, a library and a general store would bring in people to your town. What should you name your town? Should you start a farm to prevent the local wildlife from dying out? You should get some sleep. Sleep would be good. You wake up on the 5th day. You decide none of this is worth it and move on in your journey."
      },
      {
        "text": "Eat some of the steel.",
        "result": "damage",
        "responseText": "Why?"
      }
    ]
  },
  {
    "id": "lore_007",
    "text": "You reach a vending machine with the branding 'Uncle Junior's Weapon Upgrades'. It appears it doesn't take any currency and just asks you to place your weapon on its shelf and press 'upgrade'.",
    "options": [
      {
        "text": "Place your weapon on the shelf and press 'upgrade'.",
        "result": "combat",
        "responseText": "Cazzata, Malanga."
      },
      {
        "text": "Move forward without upgrading your weapon.",
        "result": "none",
        "responseText": "Nothing is free in this life. I'll pass."
      },
      {
        "text": "Check behind the vending machine for any other services it may or may not have.",
        "result": "none",
        "responseText": "There is nothing behind the vending machine."
      },
      {
        "text": "Press upgrade without placing your weapon on the shelf.",
        "result": "item",
        "details": "poison",
        "amount": 5,
        "damage": 2,
        "responseText": "The vending machine fires on and violently spits out a glass vial full of a green liquid. It shatters on your face. It appears to be poison."
      }
    ]
  },
  {
    "id": "lore_008",
    "text": "You come across a treasure chest. The lock appears to be busted.",
    "options": [
      {
        "text": "Open the chest",
        "responseText": "There appears to be gold in that there chest.",
        "effect": "item",
        "details": "gold",
        "amount": 50
      },
      {
        "text": "Walk beyond it and continue on.",
        "responseText": "Doubtful there is anything in there if the lock is busted.",
        "result": "none"
      },
      {
        "text": "Admire the treasure chest from afar",
        "responseText": "'This is a nice treasure chest.'",
        "result": "none"
      },
      {
        "text": "Kick the treasure chest",
        "responseText": "Your foot hurts now.",
        "result": "damage-minor"
      }
    ]
  },
  {
    "id": "lore_009",
    "text": "You see a very large statue in a clearing. It appears to be thousands of years old. It is surrounded by ruined rock and structures that have seen better days. The statue appears to be in decent shape and has not succumbed to the elements. Approaching the statue, you can see a plaque. Written on the plaque is the following: 'To our leader in laughter, Norm. What is green and has wheels?' The plaque appears to ask a question.",
    "options": [
      {
        "text": "Respond with 'swords?'",
        "responseText": "Nothing happens.",
        "result": "none"
      },
      {
        "text": "Respond with 'rocks?'",
        "responseText": "Nothing happens.",
        "result": "none"
      },
      {
        "text": "Respond with 'clouds?'",
        "responseText": "Nothing happens.",
        "result": "none"
      },
      {
        "text": "Respond with 'grass?'",
        "responseText": "The statue slowly moves to the south, revealing an entryway to an underground path. Above the archway that leads into the path reads another plaque that says 'Grass. I lied about the wheels'. The path appears to be a shortcut through the forest.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 6
      }
    ]
  },
  {
    "id": "lore_010",
    "text": "There is a sturdy bridge ahead of you. The bridge may be short, but it appears to be made up of squares. Each square a different color. The first four squares are colored Red, White, Green, and Blue. Each square has 'Currents murmur my name, the daylight wears my face, sorrow drapes itself in my hue, and I wait beneath your next footfall' written on them respectively.",
    "options": [
      {
        "text": "Step on the Green square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the White square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the Blue square",
        "responseText": "The Blue square lights up, then dims. Then all the squares turn blue. You walk across the bridge safely.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 6
      },
      {
        "text": "Step on the Red square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      }
    ]
  },
  {
    "id": "lore_011",
    "text": "There is a sturdy bridge ahead of you. The bridge may be short, but it appears to be made up of squares. These squares have arrows pointing North, South, East, and West. The squares have written on them 'You’ll want warmth upon the road to me, The faithful star holds my name, The sky stretches on with my voice, And I lie just ahead, beneath your next step.'",
    "options": [
      {
        "text": "Step on the North square",
        "responseText": "The North square lights up, then all 4 squares light up. Then they slowly dim and suddenly change into one large arrow pointing toward the end of the bridge allowing you to cross it safely.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 10
      },
      {
        "text": "Step on the South square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the East square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      },
      {
        "text": "Step on the West square",
        "result": "damage",
        "responseText": "The bridge shakes and crumbles beneath your feet. You fall into the ravine below and take -5 Damage."
      }
    ]
  },
  {
    "id": "lore_012",
    "text": "There is a crate in front of you that appears to have a series of wires that loop around the outside and feed into the inside. A note sits beside the crate that says 'CAUTION: Do NOT cut the Red wire.'.",
    "options": [
      {
        "text": "Cut the Red Wire",
        "responseText": "The crate explodes and throws you back 50 feet. Following directions appears to be your weak suit.",
        "result": "damage-major"
      },
      {
        "text": "Cut the Green Wire",
        "effect": "item",
        "details": "gold",
        "amount": 45,
        "responseText": "The crate whirs a low tone and then immediately opens up, all 4 sides collapsing to the ground. A pile of gold is revealed."
      },
      {
        "text": "Cut All of the Wires",
        "result": "damage-major",
        "responseText": "You cut the Blue Wire and nothing happens. You cut the Green Wire and the crate starts emitting a loud whirring sound. You panic and cut the Red Wire and the crate explodes and throws you back 50 feet. Impatience isn't a virtue."
      },
      {
        "text": "Cut the Blue Wire",
        "result": "none",
        "responseText": "Nothing happens."
      }
    ]
  },
  {
    "id": "lore_013",
    "text": "You come across a bubbling swamp. The steam from the swamp is apparent and the smell is sulfuric and strong. There does appear to be a way around, but if you cut through the swamp, you might get hurt. However, you will save some time.",
    "options": [
      {
        "text": "Walk carefully to the other side through the swamp.",
        "responseText": "You make it across, saving time but also taking some damage as well.",
        "result": "shortcut-damage",
        "details": "recover"
      },
      {
        "text": "Walk around the left side of the swamp",
        "result": "combat",
        "responseText": "There was an enemy waiting to ambush you on the left side."
      },
      {
        "text": "Walk around the right side of the swamp",
        "effect": "item",
        "details": "gold",
        "amount": 58,
        "responseText": "You make it safely to the other side of the putrid swamp. While walking, you find a bag with 30 gold pieces in it."
      },
      {
        "text": "Take off all of your clothes, wrap them in your travel blanket, tie the blanket to your ankle, and swim like a graceful dolphin through the swamp.",
        "result": "damage-major",
        "responseText": "That was painful."
      }
    ]
  },
  {
    "id": "lore_014",
    "text": "After following a set of train tracks for 2 miles, you come across a train station heading to far away lands.",
    "options": [
      { "text": "Blackstaff Tower", "routeTitle": "College_Fjord" },
      {
        "text": "The Forgotten Bard Tree",
        "routeTitle": "The_Bund"
      },
      {
        "text": "Duran's Cliff",
        "routeTitle": "Rio_de_Janeiro"
      },
      { "text": "Oceanside Caverns", "routeTitle": "Great_Barrier_Reef" },
      {
        "text": "No, thank you.",
        "result": "none",
        "responseText": "THE SCROLL DEALER: Be careful out there..."
      }
    ]
  },
  {
    "id": "lore_015",
    "text": "You find a dusty old chest hidden beneath a gnarled tree root. It looks untouched for centuries.",
    "options": [
      {
        "text": "Open the chest carefully.",
        "responseText": "The chest creaks open, revealing a small pouch of gold.",
        "effect": "item",
        "details": "gold",
        "amount": 15
      },
      {
        "text": "Open the chest in a fit of rage.",
        "responseText": "The chest violently opens, revealing a small pouch of gold.",
        "effect": "item",
        "details": "gold",
        "amount": 15
      },
      {
        "text": "Leave the chest, it might be cursed.",
        "responseText": "You decide against opening the chest and move on.",
        "result": "none"
      },
      {
        "text": "Punch the chest",
        "result": "damage",
        "responseText": "You decide to punch the chest for some reason."
      }
    ]
  },
  {
    "id": "lore_016",
    "text": "You find a wooden box sitting in the mud. Inside the box, you find 6 masks. Outside of each mask, dawning a letter on the forehead, you notice the masks are otherwise featureless. Each mask has a different letter: F, P, W, R, C, and S.",
    "options": [
      {
        "text": "Put on the F mask.",
        "result": "item",
        "details": "weapon",
        "responseText": "You feel power flowing through your veins."
      },
      {
        "text": "Put on the P mask.",
        "result": "item",
        "details": "shield",
        "responseText": "You feel safer and ready for any attack."
      },
      {
        "text": "Put on the W mask.",
        "responseText": "You feel more confident that you will win this fight.",
        "result": "special",
        "details": "recover",
        "amount": 2
      },
      {
        "text": "Put on the R mask.",
        "responseText": "You feel richer than ever.",
        "effect": "item",
        "details": "gold",
        "amount": 15
      },
      {
        "text": "Put on the C mask.",
        "result": "item",
        "details": "health-major",
        "responseText": "You feel healthier than ever."
      },
      {
        "text": "Put on the S mask.",
        "result": "item",
        "details": "health-major",
        "responseText": "You feel healthier than ever."
      }
    ]
  },
  {
    "id": "lore_017",
    "text": "You come across a tavern that seems to be bustling with life. As you walk in, you see several patrons drinking and yelling in excitement. They appear to be surrounded by something called Tymora’s Spinner. You ask one patron what is going on and they say 'I have lost 10 times in a row on this stupid game. Here, have my last gold piece. See if your luck is better than mine.' You accept the gold piece. After watching a couple of rounds, it appears you can spend 1 gold piece to bet on a range of numbers and if the ball lands in that range, you win.",
    "options": [
      {
        "text": "Bet the gold piece on range 1-10",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 11-20",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 21-30",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 31-40",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 41-50",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 51-60",
        "responseText": "You win.",
        "effect": "item",
        "details": "gold",
        "amount": 50
      },
      {
        "text": "Bet the gold piece on range 61-70",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 71-80",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 81-90",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Bet the gold piece on range 91-100",
        "responseText": "You lost.",
        "result": "item",
        "details": "gold",
        "amount": 0
      },
      {
        "text": "Don't bet. Keep the gold piece and leave the tavern.",
        "responseText": "'I can't leave my life up to chance.'",
        "result": "item",
        "details": "gold",
        "amount": 1
      }
    ]
  },
  {
    "id": "lore_018",
    "text": "There appears to be a stone block with a hole carved into it. The hole appears to be worn away while the rest of the block seems to be smooth. While staring at the block, you hear the sound of a voice that shouts 'Halt, trespasser. If you come any closer, you better tell me how fast you want to die.'",
    "options": [
      {
        "text": "Test the voice and take one small step forward.",
        "result": "item",
        "details": "poison",
        "amount": 10,
        "damage": 1,
        "responseText": "The voice shouts 'I warned you.' and spits a small dose of poison from the hole in the stone block."
      },
      {
        "text": "Decide the voice is bluffing and start running toward the stone block with your weapon.",
        "result": "item",
        "details": "poison",
        "amount": 10,
        "damage": 2,
        "responseText": "The voice shouts 'I warned you.' and spits a medium dose of poison from the hole in the stone block."
      },
      {
        "text": "'Oh yeah? What are you going to do... spit a large dose of poison from that hole in the stone block?'",
        "result": "item",
        "details": "poison",
        "amount": 15,
        "damage": 2,
        "responseText": "The voice spits a large dose of poison from the hole in the stone block."
      },
      {
        "text": "Turn around and walk away.",
        "result": "none",
        "responseText": "The voice yells 'Yeah, you better walk away.'"
      }
    ]
  },
  {
    "id": "lore_020_wizards_tower",
    "dialogueNodes": {
      "start": {
        "text": "Before you stands an ominous wizard's tower, its stone weathered and ancient. Rumors whisper that the wizard who once lived here was slain, and now a monstrous entity inhabits its halls. The monster refuses to leave and the nearby town fears it.",
        "options": [
          {
            "text": "Open the main entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "main_entrance"
          },
          {
            "text": "Search for a less obvious way in.",
            "flow": "dialogue_branch",
            "next_node_id": "hidden_entry_search"
          },
          {
            "text": "Decide it's too dangerous and leave.",
            "flow": "close_encounter",
            "responseText": "Maybe someone else can kill the monster..."
          }
        ]
      },
      "main_entrance": {
        "text": "The heavy oak doors are slightly ajar, revealing a dark, dusty foyer. A faint, metallic scent hangs in the air.",
        "options": [
          {
            "text": "Step cautiously into the foyer, trying to make not even a footstep apparent.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          },
          {
            "text": "Push the doors wide open and announce your presence.",
            "result": "mini_boss_combat",
            "miniBossType": "Bog Hag (Wearing the skin of the Wizard)",
            "responseText": "The monster announces their presence as well with a loud growl..."
          },
          {
            "text": "Reconsider and look for another way in.",
            "flow": "dialogue_branch",
            "next_node_id": "hidden_entry_search"
          }
        ]
      },
      "hidden_entry_search": {
        "text": "You circle the tower, examining its crumbling walls. Near the back, you find a small, overgrown service entrance, almost completely hidden by ivy. It looks less used, but potentially unstable.",
        "options": [
          {
            "text": "Try the service entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "service_entrance"
          },
          {
            "text": "Go back to the main entrance.",
            "flow": "dialogue_branch",
            "next_node_id": "main_entrance"
          }
        ]
      },
      "service_entrance": {
        "text": "The service door creaks open with surprising ease. Inside, a narrow, dimly lit corridor stretches before you. You notice a glimmer in a shadowy corner.",
        "options": [
          {
            "text": "Investigate the glimmer.",
            "effect": "item",
            "details": "gold",
            "amount": 25,
            "responseText": "You find a small pouch dropped by a previous visitor, containing 10 gold pieces. You continue on...",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          },
          {
            "text": "Proceed down the corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "foyer": {
        "text": "The foyer is grand but decaying. A majestic, spiraling staircase dominates the center, and two dark corridors lead off to the left and right.",
        "options": [
          {
            "text": "Ascend the grand staircase.",
            "flow": "dialogue_branch",
            "next_node_id": "grand_staircase"
          },
          {
            "text": "Take the left corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "left_corridor"
          },
          {
            "text": "Take the right corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "right_corridor"
          }
        ]
      },
      "grand_staircase": {
        "text": "The stairs creak under your weight, echoing loudly. Halfway up, a trap unsprings and you see a dozen nails flying in your direction.",
        "options": [
          {
            "text": "Quickly dodge the nail trap.",
            "effect": "damage-minor",
            "amount": 3,
            "responseText": "You manage to avoid the worst, but a nail grazes your arm. You take 3 damage. You continue on.",
            "flow": "dialogue_branch",
            "next_node_id": "top_of_tower"
          },
          {
            "text": "Tank the nail trap.",
            "flow": "dialogue_branch",
            "effect": "damage-minor",
            "amount": 10,
            "responseText": "You tank the nails and a few get stuck in your skin. You take 10 damage. You continue on.",
            "next_node_id": "top_of_tower"
          }
        ]
      },
      "left_corridor": {
        "text": "This corridor is lined with empty shelves and overturned furniture. It smells faintly of dust and something sweet. You spot a discarded vial on the floor.",
        "options": [
          {
            "text": "Pick up the vial.",
            "result": "item",
            "details": "health",
            "responseText": "You pick up the vial. It's a Health Potion. A lucky find. You continue on.",
            "flow": "dialogue_branch",
            "next_node_id": "dead_end_left"
          },
          {
            "text": "Continue to the end of the corridor.",
            "flow": "dialogue_branch",
            "next_node_id": "dead_end_left"
          }
        ]
      },
      "right_corridor": {
        "text": "This corridor is surprisingly well-maintained, adorned with faded tapestries. The air here is colder, and you hear a faint, guttural growl from deeper within.",
        "options": [
          {
            "text": "Follow the growling sound.",
            "flow": "dialogue_branch",
            "next_node_id": "monster_lair_approach"
          },
          {
            "text": "Return to the foyer.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "dead_end_left": {
        "text": "The corridor ends abruptly at a solid, unyielding wall. There's no way forward here.",
        "options": [
          {
            "text": "Return to the foyer.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "monster_lair_approach": {
        "text": "The growling grows louder, echoing from a large, ornate door at the end of the corridor.",
        "options": [
          {
            "text": "Brace yourself and open the door.",
            "result": "mini_boss_combat",
            "miniBossType": "Bog Hag (Wearing the skin of the Wizard)",
            "responseText": "The monster announces their presence by emitting an ear piercing growl."
          },
          {
            "text": "Hesitate and return to the foyer.",
            "flow": "dialogue_branch",
            "next_node_id": "foyer"
          }
        ]
      },
      "top_of_tower": {
        "text": "You reach the top floor. The wizard's study is here, filled with arcane instruments and dusty tomes. A strange, pulsating orb floats in the center of the room.",
        "options": [
          {
            "text": "Confront the pulsating orb.",
            "result": "mini_boss_combat",
            "miniBossType": "Bog Hag (Wearing the skin of the Wizard)",
            "responseText": "The orb flares brightly, revealing its true, monstrous form."
          },
          {
            "text": "Search the study for clues.",
            "effect": "item",
            "details": "gold",
            "amount": 30,
            "responseText": "You quickly search the study, finding a hidden stash of gold beneath a loose floorboard.",
            "flow": "dialogue_branch",
            "next_node_id": "top_of_tower_search_outcome"
          },
          {
            "text": "Descend the stairs and leave the tower.",
            "flow": "close_encounter",
            "responseText": "You decide the top floor is too dangerous for now. You carefully descend and leave the tower."
          }
        ]
      },
      "top_of_tower_search_outcome": {
        "text": "You've found some gold.",
        "options": [
          {
            "text": "Confront the pulsating orb.",
            "result": "mini_boss_combat",
            "miniBossType": "Bog Hag (Wearing the skin of the Wizard)",
            "responseText": "The orb flares brightly, revealing its true, monstrous form."
          },
          {
            "text": "Descend the stairs and leave the tower.",
            "flow": "close_encounter",
            "responseText": "You decide the top floor is too dangerous for now. You carefully descend and leave the tower."
          }
        ]
      }
    }
  },
  {
    "id": "lore_021_whispering_well",
    "dialogueNodes": {
      "start": {
        "text": "You discover an ancient stone well, strangely overgrown with a gnarled, moss-covered tree that seems to sprout directly from its depths.",
        "options": [
          {
            "text": "Use the tree to climb down the well.",
            "flow": "dialogue_branch",
            "next_node_id": "well_bottom"
          },
          {
            "text": "Walk away. Some mysteries are best left alone.",
            "flow": "close_encounter",
            "responseText": "You decide the well holds more trouble than treasure and continue on your journey."
          }
        ]
      },
      "well_bottom": {
        "text": "You touch down into shallow, cool water. The air is damp, and a faint light reveals a narrow tunnel leading away from the bottom of the well. The tunnel seems to lead towards a distant, flickering light and the faint sounds of voices.",
        "options": [
          {
            "text": "Follow the tunnel cautiously towards the light.",
            "flow": "dialogue_branch",
            "next_node_id": "tunnel_fork"
          },
          {
            "text": "Walk through the tunnel yelling and screaming like a crazy person.",
            "result": "mini_boss_combat",
            "miniBossType": "Lich Apprentice",
            "responseText": "Your shouts echo, and a monstrous growl answers. A hulking figure bursts from the shadows, ready for a fight."
          },
          {
            "text": "Climb back out of the well.",
            "flow": "close_encounter",
            "responseText": "The well's depths are too unsettling. You carefully climb back to the surface and leave."
          }
        ]
      },
      "tunnel_fork": {
        "text": "The tunnel opens into a small cavern. Ahead, the tunnel continues straight, but a smaller, darker passage branches off to your left. The sounds of the voices seem closer down the straight path.",
        "options": [
          {
            "text": "Go left into the darker passage.",
            "flow": "dialogue_branch",
            "next_node_id": "ladder_to_camp"
          },
          {
            "text": "Go straight, deeper into the main tunnel.",
            "flow": "dialogue_branch",
            "next_node_id": "straight_path_fork"
          },
          {
            "text": "Turn around and climb out of the well. This is too risky.",
            "flow": "close_encounter",
            "responseText": "The thought of bandits makes you reconsider. You backtrack and climb out of the well."
          }
        ]
      },
      "ladder_to_camp": {
        "text": "The dark passage leads to a rickety wooden ladder ascending into what sounds like a very active bandit camp. You hear boisterous laughter and the clinking of steel. Going up this ladder now would surely lead to immediate discovery and probably death.",
        "options": [
          {
            "text": "Say 'screw it' and go up the ladder.",
            "result": "mini_boss_combat",
            "miniBossType": "Bandit Camp",
            "responseText": "You bravely and foolishly ascend the ladder. You're immediately spotted."
          },
          {
            "text": "Go back and take the straight path instead.",
            "flow": "dialogue_branch",
            "next_node_id": "straight_path_fork"
          },
          {
            "text": "Go back the way you came and leave the well.",
            "flow": "close_encounter",
            "responseText": "The bandit camp is too dangerous. You retreat and leave the well behind."
          }
        ]
      },
      "straight_path_fork": {
        "text": "The straight tunnel continues, then forks again. To your left, you see a faint, soft glow. To your right, you hear a low, rhythmic thudding sound.",
        "options": [
          {
            "text": "Turn left towards the soft glow.",
            "result": "item",
            "details": "health",
            "responseText": "You find a hidden alcove with a glowing moss that, when consumed, restores 10 HP. It tastes faintly of lemon and regret.",
            "flow": "dialogue_branch",
            "next_node_id": "exit_tunnel_safe"
          },
          {
            "text": "Turn right towards the thudding sound.",
            "result": "mini_boss_combat",
            "miniBossType": "Lich Apprentice",
            "responseText": "The thudding grows louder, revealing a crude training area where a hulking brute practices with a heavy club. It sees you."
          },
          {
            "text": "Go back the way you came and leave the well.",
            "flow": "close_encounter",
            "responseText": "You've seen enough of this underground network. You retreat and leave the well."
          }
        ]
      },
      "exit_tunnel_safe": {
        "text": "The tunnel continues for a short distance and opens into a secluded part of the forest, far from the bandit camp. You've found a safe exit.",
        "options": [
          {
            "text": "Exit the tunnel and continue your journey.",
            "flow": "close_encounter",
            "responseText": "You emerge from the tunnel, blinking in the sunlight, ready for your next adventure."
          }
        ]
      }
    }
  },
  {
    "id": "lore_027_twin_trunked_oak",
    "dialogueNodes": {
      "start": {
        "text": "You find yourself at a section of the Silent River, flowing gently. The air is fresh, and the sound of distant birds fills the quiet. You notice several prominent landmarks nearby.",
        "options": [
          {
            "text": "Search west, against the current.",
            "result": "none",
            "responseText": "You walk for a while, but the landscape feels unpromising. Nothing stands out."
          },
          {
            "text": "Head east along the riverbank.",
            "flow": "dialogue_branch",
            "next_node_id": "step_1_riverbank_east"
          },
          {
            "text": "Cross the river to the opposite bank.",
            "result": "damage-minor",
            "responseText": "The current is stronger than it looks, and you slip on a wet stone, scraping your knee. You manage to cross, but there's nothing of note on the other side. You give up."
          },
          {
            "text": "Look for signs of a recent campsite nearby.",
            "result": "none",
            "responseText": "You search for signs of recent activity, but this immediate area seems untouched."
          },
          {
            "text": "Turn around and leave this area.",
            "flow": "close_encounter",
            "responseText": "Feeling unsure, you decide to leave the river behind for now."
          }
        ]
      },
      "step_1_riverbank_east": {
        "text": "You follow the river east. After some time, a truly immense twin-trunked oak tree dominates the landscape on the eastern bank, just as a faded drawing might suggest. Its ancient roots sprawl, creating a network around its base.",
        "options": [
          {
            "text": "Look for carvings on the tree trunks.",
            "result": "none",
            "responseText": "The bark is ancient and deeply grooved, but there are no discernible carvings. This is a fool's errand. You give up."
          },
          {
            "text": "Check the ground under the tree's canopy for anything hidden.",
            "result": "item",
            "details": "health",
            "responseText": "You find a patch of wild berries. A small snack, but nothing more. This is a fool's errand. You give up."
          },
          {
            "text": "Walk around the tree to inspect it from all sides.",
            "result": "none",
            "responseText": "You circle the massive oak, admiring its scale, but find no obvious secrets. You feel dizzy and decide to give up."
          },
          {
            "text": "Examine the roots at the base of the tree.",
            "flow": "dialogue_branch",
            "next_node_id": "step_2_examine_roots"
          },
          {
            "text": "Turn around and leave this area.",
            "flow": "close_encounter",
            "responseText": "Feeling unsure, you decide to leave the magnificent oak behind for now."
          }
        ]
      },
      "step_2_examine_roots": {
        "text": "You meticulously examine the intricate root system at the base of the twin-trunked oak. After a few moments, your hand brushes against a section that feels hollow. With a gentle push, a camouflaged panel slides inward, revealing a dark, narrow passage leading down into the earth. The air immediately grows damp and cool.",
        "options": [
          {
            "text": "Descend into the dark passage.",
            "flow": "dialogue_branch",
            "next_node_id": "step_3_follow_water_flow"
          },
          {
            "text": "Try to force the panel open further.",
            "result": "damage-minor",
            "next_node_id": "step_2_examine_roots",
            "responseText": "The panel grinds, and a shard of stone breaks off, cutting your hand. It's clear forcing it won't work."
          },
          {
            "text": "Look for another way into the passage.",
            "result": "none",
            "next_node_id": "step_2_examine_roots",
            "responseText": "The passage seems to have only one, discreet entrance. You can't find another way in."
          },
          {
            "text": "Reconsider and return to the surface.",
            "flow": "dialogue_branch",
            "next_node_id": "step_1_riverbank_east"
          },
          {
            "text": "Turn around and leave this area.",
            "flow": "close_encounter",
            "responseText": "The darkness of the passage seems too daunting. You decide to leave this area."
          }
        ]
      },
      "step_3_follow_water_flow": {
        "text": "You are now within the initial cavern of the Sunken Grotto. The passage is dimly lit by a faint, ambient glow from the mosses. You can hear the constant sound of flowing water. The water leads to a large, unusually smooth boulder, distinct from the rough cavern walls. Four vertical lines are etched into its surface, numbered from left to right: 1st Line, 2nd Line, 3rd Line, 4th Line.",
        "options": [
          {
            "text": "Press the 1st, 2nd, 3rd, 4th lines.",
            "result": "mini_boss_combat",
            "miniBossType": "Grotto Banshee",
            "responseText": "You press the lines, but nothing happens. The boulder remains stubbornly in place. Suddenly, from the cracks of the boulder comes a mist that quickly forms into a Banshee. The Banshee screams..."
          },
          {
            "text": "Press the 4th, 3rd, 2nd, 1st lines.",
            "result": "mini_boss_combat",
            "miniBossType": "Grotto Banshee",
            "responseText": "You press the lines in reverse order, but the boulder doesn't budge. Suddenly, from the cracks of the boulder comes a mist that quickly forms into a Banshee. The Banshee screams..."
          },
          {
            "text": "Press the 3rd, 1st, 4th, 2nd lines.",
            "flow": "dialogue_branch",
            "next_node_id": "step_4_door_open",
            "responseText": "With a deep rumble, the massive boulder slowly grinds inward, revealing a new, dark passage beyond. The air stirs, carrying a scent of old earth and something metallic."
          },
          {
            "text": "Attempt to force the boulder.",
            "result": "mini_boss_combat",
            "miniBossType": "Grotto Banshee",
            "responseText": "You strain to open the boulder but it does not budge. Suddenly, from the cracks of the boulder comes a mist that quickly forms into a Banshee. The Banshee screams..."
          },
          {
            "text": "Turn around and leave the grotto.",
            "flow": "close_encounter",
            "responseText": "The grotto feels too confusing. You decide to turn back."
          }
        ]
      },
      "step_4_door_open": {
        "text": "The boulder has opened a new path. You find yourself in a dimly lit section of the grotto with two distinct tunnels leading deeper. One veers left, and the other goes right.",
        "options": [
          {
            "text": "Take the left tunnel.",
            "flow": "dialogue_branch",
            "next_node_id": "step_5_left_tunnel_chest_puzzle"
          },
          {
            "text": "Take the right tunnel.",
            "flow": "close_encounter",
            "responseText": "You follow the right tunnel. It opens into a larger, underground river, which quickly carries you out into the daylight, far from the grotto's mysteries."
          },
          {
            "text": "Turn around and leave the grotto.",
            "flow": "close_encounter",
            "responseText": "The grotto feels too daunting. You decide to turn back."
          }
        ]
      },
      "step_5_left_tunnel_chest_puzzle": {
        "text": "The left tunnel narrows then opens into a small, secluded chamber. In the center, a sturdy wooden treasure chest sits, bound with iron bands. A curious numerical lock adorns its front, requiring a single number as input.",
        "options": [
          {
            "text": "Enter '5'.",
            "result": "mini_boss_combat",
            "miniBossType": "Grotto Banshee",
            "responseText": "You enter the number, but the lock stays firmly closed. From the locks seams comes a mist that quickly forms into a Banshee. The Banshee screams..."
          },
          {
            "text": "Enter '7'.",
            "result": "mini_boss_combat",
            "miniBossType": "Grotto Banshee",
            "responseText": "You enter the number, but the lock stays firmly closed. From the locks seams comes a mist that quickly forms into a Banshee. The Banshee screams..."
          },
          {
            "text": "Enter '10'.",
            "effect": "item",
            "details": "gold",
            "amount": 100,
            "responseText": "With a satisfying click, the lock springs open. Inside, glimmers a cache of coins."
          },
          {
            "text": "Enter '12'.",
            "result": "mini_boss_combat",
            "miniBossType": "Grotto Banshee",
            "responseText": "You enter the number, but the lock stays firmly closed. From the locks seams comes a mist that quickly forms into a Banshee. The Banshee screams..."
          },
          {
            "text": "Turn around and leave the grotto.",
            "flow": "close_encounter",
            "responseText": "The chest's puzzle is too perplexing. You decide to leave."
          }
        ]
      }
    }
  },
  {
    "id": "lore_023_abandoned_campfire",
    "dialogueNodes": {
      "start": {
        "text": "You find the remains of a recently abandoned campfire. Embers glow faintly beneath a pile of ash, and a worn leather journal lies beside a half-eaten, petrified meal. It looks like it was left in a hurry.",
        "options": [
          {
            "text": "Read the journal.",
            "flow": "dialogue_branch",
            "next_node_id": "journal_entry_1"
          },
          {
            "text": "Search the campsite thoroughly.",
            "effect": "item",
            "details": "gold",
            "amount": 10,
            "responseText": "You sift through the ashes and find a few tarnished coins. Not much, but every piece counts.",
            "flow": "dialogue_branch"
          },
          {
            "text": "Put out the embers and move on.",
            "result": "none",
            "responseText": "You carefully douse the remaining embers. The wilderness can be unforgiving with unattended fires. You continue your journey."
          }
        ]
      },
      "journal_entry_1": {
        "text": "The journal's first page is dated weeks ago and appears to be marked with a '⚲' as if it's marking some sort importance: 'Day 1: The cartographers maps were right. The 'Missing Grotto' is real, just as the legends foretold. I'm camped near what they call the 'Quiet River Bend' now. Legend has it, this Grotto was a safe house for Pirates. There is a well known pirate shanty I sing to keep my spirits up: ⚲ 'A pi-rates life is ne-ver through, three, then one, then four, then two' ⚲ Next, I'll head ⚲ east along the riverbank. ⚲'",
        "options": [
          {
            "text": "Turn to the next entry.",
            "flow": "dialogue_branch",
            "next_node_id": "journal_entry_2"
          },
          {
            "text": "Close the journal for now.",
            "flow": "close_encounter",
            "responseText": "You close the dusty journal, the prospector's initial excitement lingering in your mind."
          }
        ]
      },
      "journal_entry_2": {
        "text": "Day 4: Spent days upstream and down. Found the landmark. It's exactly as described: a colossal ⚲ twin-trunked oak tree ⚲ on the eastern bank. The entrance is cunningly disguised, marked right at its base. Clever. From here, I need to focus on the ⚲ roots at the base of the tree. ⚲'",
        "options": [
          {
            "text": "Turn to the next entry.",
            "flow": "dialogue_branch",
            "next_node_id": "journal_entry_3"
          },
          {
            "text": "Close the journal for now.",
            "flow": "close_encounter",
            "responseText": "You close the dusty journal, the prospector's excitement about the twin-trunked oak lingering in your mind."
          }
        ]
      },
      "journal_entry_3": {
        "text": "Day 7: The grotto is breathtaking. The river truly weeps stone inside, stalactites shimmering like frozen tears. Reached the main chamber. Found an unusual boulder, with lines etched vertically. ⚲ I sing the Pirates Grotto Shanty.'",
        "options": [
          {
            "text": "Turn to the next entry.",
            "flow": "dialogue_branch",
            "next_node_id": "journal_entry_4"
          },
          {
            "text": "Close the journal for now.",
            "flow": "close_encounter",
            "responseText": "You close the dusty journal, envisioning the shimmering magic of the grotto and the mysterious boulder."
          }
        ]
      },
      "journal_entry_4": {
        "text": "Day 10: Beyond the boulder, there are two tunnels. The right leads back to the bigger river. The ⚲ left ⚲ seems to lead to a chamber with a chest. I heard those who used this grotto often locked their treasures using existing secrets but ⚲ adding, subtracting, multiplying, and then adding again... ⚲ whatever that means.",
        "options": [
          {
            "text": "Turn to the next entry.",
            "flow": "dialogue_branch",
            "next_node_id": "journal_entry_5"
          },
          {
            "text": "Close the journal for now.",
            "flow": "close_encounter",
            "responseText": "You close the dusty journal, pondering the riddle of the chest."
          }
        ]
      },
      "journal_entry_5": {
        "text": "Finders note: I found this journal floating down the river. I leave it here in case the original owner has kin who would like the keep it. It is for certain the original owner did not survive whatever did them in. Whoever finds this, please put out my campfire if it's still going.",
        "options": [
          {
            "text": "Close the journal.",
            "flow": "quest_start",
            "quest_id": "the_hidden_cache",
            "responseText": "You close the journal, the new prospector's words echoing in your mind. A complex grotto, a challenging chest, and a campfire to extinguish... your adventure truly begins now."
          },
          {
            "text": "Go back to the first entry.",
            "flow": "dialogue_branch",
            "next_node_id": "journal_entry_1"
          }
        ]
      }
    }
  },
  {
    "id": "lore_028",
    "text": "A stone sundial stands in a clearing, but the shadow it casts points in the wrong direction. Carved along its edge: 'Time obeys no one, least of all this sundial.'",
    "options": [
      {
        "text": "Adjust the gnomon to correct the shadow.",
        "result": "item",
        "details": "shield",
        "responseText": "The shadow snaps into place and the sundial hums briefly. A faint shimmer envelops you. You feel more protected."
      },
      {
        "text": "Stand in the shadow.",
        "result": "damage-minor",
        "responseText": "The shadow is freezing cold. Your bones ache. That was a poor decision."
      },
      {
        "text": "Smash the sundial with your weapon.",
        "result": "damage",
        "responseText": "The sundial shatters and a shard bounces directly into your shin. The universe punishes vandalism swiftly."
      },
      {
        "text": "Walk past it. You don't have time for time.",
        "result": "none",
        "responseText": "'I have places to be and none of them involve broken clocks.'"
      }
    ]
  },
  {
    "id": "lore_029",
    "text": "You discover a pond that is perfectly still. Not a single ripple. A fish floats motionless at the surface, seemingly frozen in place. It blinks at you.",
    "options": [
      {
        "text": "Reach in and grab the fish.",
        "result": "item",
        "details": "health",
        "responseText": "The fish unfreezes the moment you touch it and slaps you across the face before flopping away. But somehow you feel healed. Fish magic, presumably."
      },
      {
        "text": "Drink from the pond.",
        "result": "special",
        "details": "recover",
        "amount": 3,
        "responseText": "The water tastes like nothing. Literally nothing. No flavor at all. But you feel remarkably refreshed."
      },
      {
        "text": "Throw a rock into the pond.",
        "result": "combat",
        "responseText": "The rock hits the water and the entire pond surface shatters like glass. Something large and angry rises from below."
      },
      {
        "text": "Stare at the fish until it gets uncomfortable.",
        "result": "none",
        "responseText": "You stare. The fish stares. Neither of you blinks. Actually, the fish blinks. You win. Nothing else happens."
      }
    ]
  },
  {
    "id": "lore_030",
    "text": "There is a stone archway covered in moss. Through the archway, you can see the same forest you are already standing in, but the colors are slightly different. A sign reads: 'Shortcut. Probably.'",
    "options": [
      {
        "text": "Walk through the archway confidently.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 8,
        "responseText": "You step through and emerge several miles ahead on the path. The sign was honest. Probably."
      },
      {
        "text": "Throw your boot through first to test it.",
        "result": "none",
        "responseText": "Your boot sails through the archway and lands on the other side. You walk around the archway to retrieve it. Nothing happened. You now have a dirty boot."
      },
      {
        "text": "Lick the moss on the archway.",
        "result": "item",
        "details": "poison",
        "amount": 8,
        "damage": 1,
        "responseText": "The moss tastes terrible and is mildly toxic. Your tongue swells up. You have been poisoned. Why would you lick moss?"
      },
      {
        "text": "Ignore the archway entirely.",
        "result": "none",
        "responseText": "'Shortcuts are for people without principles.' You walk past it with unearned pride."
      }
    ]
  },
  {
    "id": "lore_031",
    "text": "A suit of armor stands upright in the middle of a field. There is no one inside it. It holds a sign that reads 'FREE HUGS'.",
    "options": [
      {
        "text": "Hug the armor.",
        "result": "damage-minor",
        "responseText": "The armor snaps shut around you like a bear trap, then releases. That was not a hug. That was an assault."
      },
      {
        "text": "Take parts of the armor for yourself.",
        "result": "item",
        "details": "shield",
        "responseText": "You pry off a well-crafted pauldron and strap it to your shoulder. Your defense increases."
      },
      {
        "text": "Push the armor over.",
        "result": "combat",
        "responseText": "The armor clatters to the ground, then slowly reassembles itself and draws a sword from nowhere. It did not appreciate that."
      },
      {
        "text": "Wave politely and keep walking.",
        "result": "none",
        "responseText": "The armor waves back. You are now uncomfortable."
      }
    ]
  },
  {
    "id": "lore_032",
    "text": "You come across a wooden signpost at a crossroads. It has four arrows, each pointing in different directions. All four arrows say 'DANGER'.",
    "options": [
      {
        "text": "Go in the direction none of the arrows point.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 5,
        "responseText": "You find a hidden trail that was deliberately not marked. It leads to a pleasant clearing and saves you considerable travel time."
      },
      {
        "text": "Pick the arrow that looks the most recently painted.",
        "result": "combat",
        "responseText": "The freshly painted arrow was a trap set by bandits who wanted to direct travelers into their ambush. You have been directed."
      },
      {
        "text": "Eat one of the arrows.",
        "result": "damage",
        "responseText": "You break off an arrow and attempt to eat it. It is made of wood. You now have splinters in your mouth and your gums are bleeding."
      },
      {
        "text": "Sit at the crossroads and contemplate existence.",
        "result": "none",
        "responseText": "You sit for twenty minutes. A squirrel judges you from a nearby branch. You learn nothing. You move on."
      }
    ]
  },
  {
    "id": "lore_033",
    "text": "A merchant's cart lies overturned on the road. Crates are scattered everywhere. Most are smashed, but one remains sealed with a wax emblem of a laughing fox.",
    "options": [
      {
        "text": "Open the sealed crate.",
        "effect": "item",
        "details": "gold",
        "amount": 75,
        "responseText": "Inside the crate is a small fortune in gold coins and a note that reads 'If you're reading this, I'm already dead. Enjoy the gold, you vulture.'"
      },
      {
        "text": "Search the other smashed crates.",
        "result": "item",
        "details": "health",
        "responseText": "Among the debris, you find an intact healing tonic wrapped in straw. Lucky find."
      },
      {
        "text": "Look for the merchant.",
        "result": "combat",
        "responseText": "You find the merchant. Well, you find what got the merchant. It sees you now."
      },
      {
        "text": "Right the cart and continue on your way.",
        "result": "none",
        "responseText": "You spend fifteen minutes righting the cart out of some misplaced sense of duty. It falls over again immediately. You leave."
      }
    ]
  },
  {
    "id": "lore_034",
    "text": "A rope bridge stretches across a chasm. The bridge looks ancient. Half the planks are missing. A goat stands in the middle of the bridge, chewing on one of the remaining planks.",
    "options": [
      {
        "text": "Shoo the goat and cross carefully.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 7,
        "responseText": "The goat bleats at you indignantly but moves aside. You cross the bridge, stepping only on the solid planks. The other side puts you well ahead on your journey."
      },
      {
        "text": "Try to ride the goat across.",
        "result": "damage-major",
        "responseText": "The goat does not consent to being ridden. It headbutts you off the bridge. You fall, grab a root, and climb back up. Everything hurts."
      },
      {
        "text": "Challenge the goat to a staring contest.",
        "result": "none",
        "responseText": "Goats have rectangular pupils. They do not blink like you do. You lose immediately. The goat resumes eating the bridge."
      },
      {
        "text": "Jump over the chasm without using the bridge.",
        "result": "damage-major",
        "responseText": "The chasm is forty feet across. You make it about six feet before gravity introduces itself."
      }
    ]
  },
  {
    "id": "lore_035_ancient_fountain",
    "dialogueNodes": {
      "start": {
        "text": "You stumble upon an ancient fountain in a ruined courtyard. Water still flows from the mouth of a carved stone lion, though the basin below is cracked and most of the water drains into the earth. Three offering bowls sit on the fountain's rim, each with a different symbol: a sword, a heart, and a coin.",
        "options": [
          {
            "text": "Examine the offering bowls more closely.",
            "flow": "dialogue_branch",
            "next_node_id": "examine_bowls"
          },
          {
            "text": "Drink from the fountain.",
            "flow": "dialogue_branch",
            "next_node_id": "drink_fountain"
          },
          {
            "text": "Search the courtyard ruins.",
            "flow": "dialogue_branch",
            "next_node_id": "search_ruins"
          },
          {
            "text": "Leave. Fountains in ruins are never good news.",
            "flow": "close_encounter",
            "responseText": "You walk away from the fountain. The stone lion seems to frown. You do not look back."
          }
        ]
      },
      "examine_bowls": {
        "text": "The three bowls are made of tarnished bronze. The sword bowl has a faint red stain. The heart bowl smells like herbs. The coin bowl has a small inscription: 'Give to receive. Or don't. I'm a bowl.'",
        "options": [
          {
            "text": "Place a coin in the coin bowl.",
            "effect": "item",
            "details": "gold",
            "amount": 60,
            "responseText": "The bowl swallows the coin and the fountain surges. A compartment opens at the lion's base, revealing a satchel of gold coins. The bowl gives more than it takes.",
            "flow": "close_encounter"
          },
          {
            "text": "Place your hand on the heart bowl.",
            "result": "item",
            "details": "health-major",
            "responseText": "Warmth floods through your body. Your wounds close and your breathing steadies. The heart bowl heals generously.",
            "flow": "close_encounter"
          },
          {
            "text": "Touch the sword bowl.",
            "result": "combat",
            "responseText": "The red stain glows and the stone lion's eyes light up. The fountain erupts and a guardian made of water and stone rises from the basin."
          },
          {
            "text": "Knock all three bowls off the fountain.",
            "result": "damage",
            "responseText": "The fountain violently jets water directly into your face with the force of a battering ram. The bowls clatter to the ground. Was it worth it?"
          }
        ]
      },
      "drink_fountain": {
        "text": "The water is ice cold and tastes faintly of copper. As you drink, you notice something glinting at the bottom of the cracked basin.",
        "options": [
          {
            "text": "Reach into the basin and grab the glinting object.",
            "result": "item",
            "details": "weapon",
            "responseText": "You pull out a small enchanted stone that pulses with energy. When you press it against your weapon, it hums and the edge sharpens. Damage base increased by 1.",
            "flow": "close_encounter"
          },
          {
            "text": "Keep drinking. The water is delicious.",
            "result": "item",
            "details": "health",
            "responseText": "You drink deeply. Your stomach gurgles but you feel restored. The copper aftertaste lingers for hours.",
            "flow": "close_encounter"
          },
          {
            "text": "Leave the basin alone.",
            "flow": "close_encounter",
            "responseText": "You step back from the fountain, refreshed but empty-handed."
          }
        ]
      },
      "search_ruins": {
        "text": "The courtyard is littered with fallen columns and crumbled walls. Behind a partially collapsed archway, you find a stone chest covered in dust. It has no lock but is extremely heavy.",
        "options": [
          {
            "text": "Use all your strength to open the chest.",
            "effect": "item",
            "details": "gold",
            "amount": 35,
            "responseText": "The lid grinds open. Inside: a modest pile of ancient coins and a very dead spider. You take the coins and leave the spider.",
            "flow": "close_encounter"
          },
          {
            "text": "Try to drag the entire chest with you.",
            "result": "damage-minor",
            "responseText": "You throw out your back almost immediately. The chest does not move. You move, but painfully.",
            "flow": "close_encounter"
          },
          {
            "text": "Return to the fountain.",
            "flow": "dialogue_branch",
            "next_node_id": "examine_bowls"
          }
        ]
      }
    }
  },
  {
    "id": "lore_036",
    "text": "You find a crow sitting on a fence post. The crow is wearing a tiny hat. It tilts its head at you and says, very clearly, 'What?'",
    "options": [
      {
        "text": "'Where did you get that hat?'",
        "result": "none",
        "responseText": "The crow looks at you, looks at its hat, looks back at you, and says 'What?' again. This conversation is going nowhere."
      },
      {
        "text": "Offer the crow some food.",
        "result": "item",
        "details": "weapon",
        "responseText": "You toss a scrap of bread. The crow eats it, then drops a small sharpening stone from inside its hat. Your weapon's damage base increases by 1. The crow says 'You're welcome' and flies away."
      },
      {
        "text": "Try to take the hat.",
        "result": "damage-minor",
        "responseText": "The crow pecks your hand viciously. It is a small bird with enormous rage. Your hand bleeds. The hat stays on the crow."
      },
      {
        "text": "Bow to the crow respectfully.",
        "effect": "item",
        "details": "gold",
        "amount": 12,
        "responseText": "The crow bows back, and several gold coins fall out of its hat. The crow seems annoyed but flies away, leaving the coins behind."
      }
    ]
  },
  {
    "id": "lore_037",
    "text": "A massive tree has fallen across the path. Its trunk is carved with hundreds of tiny faces, each with a different expression. One face near eye level appears to be whispering.",
    "options": [
      {
        "text": "Lean in to hear what the face is whispering.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 6,
        "responseText": "The face whispers directions to a hidden path that bypasses the dense forest ahead. 'Go left at the mushroom, right at the skull, and straight through the hollow log. You're welcome, ugly.'"
      },
      {
        "text": "Whisper back to the face.",
        "result": "none",
        "responseText": "You whisper 'hello' back. All the faces on the log simultaneously say 'HELLO' in unison. Then silence. You are deeply unsettled."
      },
      {
        "text": "Climb over the log.",
        "result": "damage-minor",
        "responseText": "Several faces bite your hands and legs as you climb. They have tiny wooden teeth. This is horrible."
      },
      {
        "text": "Set the log on fire.",
        "result": "damage-major",
        "responseText": "The log erupts into flame immediately, as if soaked in oil. The blast of heat throws you backward. Hundreds of tiny carved faces scream. You smell like smoke and shame."
      }
    ]
  },
  {
    "id": "lore_038",
    "text": "You find a cave entrance with a sign that reads 'ECHO CAVE: Please do not yell. The echo has feelings.' From inside, you hear a faint humming.",
    "options": [
      {
        "text": "Enter the cave quietly and follow the humming.",
        "result": "item",
        "details": "health-major",
        "responseText": "The humming leads you to a small crystal that vibrates with healing energy. You touch it and feel your wounds mend. The echo whispers 'thank you for being quiet.'"
      },
      {
        "text": "Yell into the cave as loud as you can.",
        "result": "damage",
        "responseText": "The echo yells back, but louder. Much louder. Your ears ring and your nose bleeds. The sign warned you."
      },
      {
        "text": "Hum along with the echo.",
        "effect": "item",
        "details": "gold",
        "amount": 20,
        "responseText": "The echo harmonizes with you and a small cache of coins rattles loose from a crack in the wall. The echo seems pleased with the duet."
      },
      {
        "text": "Block the cave entrance with rocks.",
        "result": "none",
        "responseText": "You spend thirty minutes stacking rocks. The echo says 'I can still see you through the cracks.' You leave, defeated."
      }
    ]
  },
  {
    "id": "lore_039_mushroom_circle",
    "dialogueNodes": {
      "start": {
        "text": "You discover a perfect circle of glowing mushrooms in a moonlit glade. The air inside the circle shimmers faintly. A stone tablet at the circle's edge reads: 'Step inside to bargain. Step outside to live.'",
        "options": [
          {
            "text": "Step into the mushroom circle.",
            "flow": "dialogue_branch",
            "next_node_id": "inside_circle"
          },
          {
            "text": "Pick one of the mushrooms.",
            "result": "item",
            "details": "poison",
            "amount": 12,
            "damage": 2,
            "responseText": "The mushroom explodes into spores when plucked. You inhale a cloud of glowing toxin. You feel considerably worse about your choices."
          },
          {
            "text": "Walk away. You've read enough fairy tales.",
            "flow": "close_encounter",
            "responseText": "You leave the glade behind. The mushrooms dim slightly, as if disappointed."
          }
        ]
      },
      "inside_circle": {
        "text": "The moment you step inside, the world goes silent. A voice speaks from everywhere and nowhere: 'Traveler. I offer three bargains. Choose one, or choose to leave with nothing. First: strength for blood. Second: knowledge for time. Third: fortune for risk.'",
        "options": [
          {
            "text": "'I choose strength for blood.'",
            "flow": "dialogue_branch",
            "next_node_id": "bargain_strength"
          },
          {
            "text": "'I choose knowledge for time.'",
            "flow": "dialogue_branch",
            "next_node_id": "bargain_knowledge"
          },
          {
            "text": "'I choose fortune for risk.'",
            "flow": "dialogue_branch",
            "next_node_id": "bargain_fortune"
          },
          {
            "text": "'I choose to leave.'",
            "flow": "close_encounter",
            "responseText": "The voice sighs. 'They always leave.' The mushrooms go dark and you find yourself standing outside the circle."
          }
        ]
      },
      "bargain_strength": {
        "text": "The voice says: 'Your weapon will grow sharper, but it will cost you pain.' You feel a burning sensation across your skin.",
        "options": [
          {
            "text": "Accept the pain.",
            "result": "item",
            "details": "weapon",
            "responseText": "Searing pain courses through you, then subsides. Your weapon gleams with new sharpness. Damage base increased by 1. You stumble out of the circle, alive but shaken.",
            "flow": "close_encounter"
          },
          {
            "text": "Refuse and step out of the circle.",
            "flow": "close_encounter",
            "responseText": "The pain vanishes. You step out of the circle, intact but empty-handed. The voice mutters 'Coward' under its breath."
          }
        ]
      },
      "bargain_knowledge": {
        "text": "The voice says: 'I will show you a path forward, but you will feel as though days have passed in seconds.'",
        "options": [
          {
            "text": "Accept the bargain.",
            "result": "shortcut",
            "details": "clicks",
            "amount": 10,
            "responseText": "A map burns itself into your mind. You see the path ahead as clearly as if you'd walked it before. You feel exhausted, as though you haven't slept in days, but you know exactly where to go.",
            "flow": "close_encounter"
          },
          {
            "text": "Refuse and step out of the circle.",
            "flow": "close_encounter",
            "responseText": "You step out of the circle. The voice says 'Your loss.' The mushrooms flicker and die."
          }
        ]
      },
      "bargain_fortune": {
        "text": "The voice says: 'Gold awaits, but so does danger. Reach into the earth beneath your feet.'",
        "options": [
          {
            "text": "Reach into the earth.",
            "effect": "item",
            "details": "gold",
            "amount": 90,
            "responseText": "Your hand plunges into soil that parts like water. You pull out a fistful of ancient gold coins. The voice laughs. The mushroom circle vanishes. You are standing in an empty glade, richer than before.",
            "flow": "close_encounter"
          },
          {
            "text": "Refuse and step out of the circle.",
            "flow": "close_encounter",
            "responseText": "You pull your hand back. The voice says nothing. The circle fades."
          }
        ]
      }
    }
  },
  {
    "id": "lore_040",
    "text": "You find a skeleton sitting against a tree, holding a piece of parchment. The skeleton is wearing sunglasses. The parchment reads: 'Waited for the bus. Day 4,372. Beginning to think it's not coming.'",
    "options": [
      {
        "text": "Search the skeleton's pockets.",
        "effect": "item",
        "details": "gold",
        "amount": 30,
        "responseText": "You find a coin purse with 30 gold pieces and an expired bus pass. The skeleton does not object."
      },
      {
        "text": "Take the sunglasses.",
        "result": "none",
        "responseText": "You put on the sunglasses. Everything is slightly darker. You do not look cooler. You leave them on a rock and move on."
      },
      {
        "text": "Sit next to the skeleton and wait for the bus.",
        "result": "none",
        "responseText": "You sit for an hour. No bus arrives. You begin to understand the skeleton's frustration. You leave before you join it."
      },
      {
        "text": "Give the skeleton a proper burial.",
        "result": "item",
        "details": "health",
        "responseText": "You dig a small grave and lay the skeleton to rest. A warm breeze passes through the trees. You feel at peace, and your health improves slightly."
      }
    ]
  },
  {
    "id": "lore_041",
    "text": "There is a large, flat boulder with a chessboard carved into its surface. The pieces are made of stone and appear to be mid-game. A note carved into the side reads: 'White to move. Checkmate in one. Solve it and claim your prize.' The white queen, knight, bishop, and rook are positioned on the board.",
    "options": [
      {
        "text": "Move the queen.",
        "result": "none",
        "responseText": "The black king yawns. That is not checkmate. The pieces reset."
      },
      {
        "text": "Move the knight.",
        "effect": "item",
        "details": "gold",
        "amount": 55,
        "responseText": "The knight lands with a satisfying click. The black king topples over. A hidden drawer slides open from the boulder, revealing a cache of gold coins. Well played."
      },
      {
        "text": "Move the bishop.",
        "result": "none",
        "responseText": "The black king looks at the bishop. The bishop looks at the king. Nothing happens. The pieces reset."
      },
      {
        "text": "Flip the board.",
        "result": "damage-minor",
        "responseText": "The stone chessboard weighs about 200 pounds. You strain to flip it, pull a muscle in your back, and accomplish nothing. The stone pieces seem to smirk at you."
      }
    ]
  },
  {
    "id": "lore_042_signal_tower",
    "text": "After climbing a steep hillside, you reach an abandoned signal tower. The beacon at the top is cold and dark, but the mechanism appears functional. A rusted lever juts from the base, and a supply room door hangs ajar.",
    "options": [
      {
        "text": "Pull the lever and light the beacon.",
        "result": "combat",
        "responseText": "The beacon roars to life, sending a column of flame into the sky. Unfortunately, it also signals your position to something that has been hunting in the area."
      },
      {
        "text": "Search the supply room.",
        "result": "item",
        "details": "health",
        "responseText": "Inside the supply room, you find dried rations and a sealed flask of medicinal tonic. The rations taste like cardboard but the tonic restores your health."
      },
      {
        "text": "Climb to the top of the tower for a better view.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 4,
        "responseText": "From the top, you can see the landscape for miles. You spot a clear path through the forest below that will save you significant travel time."
      },
      {
        "text": "Write your name on the tower wall and leave.",
        "result": "none",
        "responseText": "You scratch your name into the stone with your blade. No one will ever read it. You feel momentarily famous and then immediately foolish."
      }
    ]
  },
  {
    "id": "lore_043",
    "text": "A perfectly rectangular hole in the ground, about three feet deep, contains exactly one potato. The potato appears to be glowing faintly purple.",
    "options": [
      {
        "text": "Eat the potato.",
        "result": "item",
        "details": "health-major",
        "responseText": "The potato tastes like a regular potato, except it hums as you chew. Your entire body tingles and your health is significantly restored. Magical potato. Who knew."
      },
      {
        "text": "Take the potato with you for later.",
        "result": "item",
        "details": "health",
        "responseText": "You pocket the potato. It pulses gently in your bag like a tiny purple heart. You gain a small amount of health from its proximity alone."
      },
      {
        "text": "Put the potato back and fill in the hole.",
        "result": "none",
        "responseText": "You rebury the potato. You feel a profound sense of having accomplished absolutely nothing."
      },
      {
        "text": "Throw the potato as far as you can.",
        "result": "damage-minor",
        "responseText": "The potato explodes mid-flight in a burst of purple light. Shrapnel hits you. It was a magic potato and you threw it. Think about what you've done."
      }
    ]
  },
  {
    "id": "lore_044_underground_market",
    "dialogueNodes": {
      "start": {
        "text": "You descend a crumbling staircase hidden beneath a fallen obelisk and emerge into an underground market. Torches flicker along the walls. Three merchants sit at crude stalls, each calling out to you. A goblin sells potions, a dwarf sells weapons, and an old woman sells 'secrets'. A tunnel at the far end appears to lead back to the surface.",
        "options": [
          {
            "text": "Approach the goblin potion seller.",
            "flow": "dialogue_branch",
            "next_node_id": "goblin_stall"
          },
          {
            "text": "Approach the dwarf weapon seller.",
            "flow": "dialogue_branch",
            "next_node_id": "dwarf_stall"
          },
          {
            "text": "Approach the old woman selling secrets.",
            "flow": "dialogue_branch",
            "next_node_id": "secrets_stall"
          },
          {
            "text": "Walk straight to the exit tunnel.",
            "flow": "close_encounter",
            "responseText": "You walk past all three merchants without stopping. The goblin shouts 'Your loss!' The dwarf shrugs. The old woman cackles. You emerge on the surface, empty-handed."
          }
        ]
      },
      "goblin_stall": {
        "text": "The goblin grins at you with too many teeth. 'Potions! Good potions! I have three. Red one heals. Blue one... also heals. Green one is a surprise.' The goblin winks. 'All free today. Marketing strategy.'",
        "options": [
          {
            "text": "Take the red potion.",
            "result": "item",
            "details": "health",
            "responseText": "The red potion tastes like cherry medicine. Your health improves. The goblin nods approvingly.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          },
          {
            "text": "Take the blue potion.",
            "result": "item",
            "details": "health-major",
            "responseText": "The blue potion tastes like blueberries and lightning. Your health improves significantly. The goblin seems surprised you chose this one.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          },
          {
            "text": "Take the green potion.",
            "result": "item",
            "details": "poison",
            "amount": 10,
            "damage": 2,
            "responseText": "The green potion tastes like lawn clippings and betrayal. It was poison. The goblin shrugs. 'I said it was a surprise.'",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          },
          {
            "text": "Decline and visit another merchant.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          }
        ]
      },
      "dwarf_stall": {
        "text": "The dwarf slams a massive hand on the counter. 'I sharpen blades. Best in the underground. One free sharpening per customer. Company policy.' He gestures at a grinding wheel behind him.",
        "options": [
          {
            "text": "Let him sharpen your weapon.",
            "result": "item",
            "details": "weapon",
            "responseText": "The dwarf works your weapon against the grinding wheel with expert precision. Sparks fly. When he hands it back, the edge could split a hair. Damage base increased by 1.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          },
          {
            "text": "Ask him to sharpen a rock instead.",
            "result": "none",
            "responseText": "The dwarf stares at you for a very long time. 'Get out of my stall.' You leave his stall.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          },
          {
            "text": "Decline and visit another merchant.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          }
        ]
      },
      "secrets_stall": {
        "text": "The old woman peers at you through milky eyes. 'I sell secrets, dear. I have one for you. The path ahead splits three ways. Two lead to ruin. One leads to fortune. Would you like to know which?'",
        "options": [
          {
            "text": "'Yes, tell me.'",
            "result": "shortcut",
            "details": "clicks",
            "amount": 8,
            "responseText": "She whispers detailed directions into your ear. The path she describes is one you would never have found on your own. She smiles. 'Now go, before I charge you.'",
            "flow": "close_encounter"
          },
          {
            "text": "'No, I prefer surprises.'",
            "result": "none",
            "responseText": "She shrugs. 'Suit yourself, dear. Most people prefer surprises right up until they don't.'",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          },
          {
            "text": "'How do I know you're telling the truth?'",
            "result": "none",
            "responseText": "'You don't.' She smiles. 'That's what makes it a secret and not a fact.' You are not sure if that's profound or nonsense.",
            "flow": "dialogue_branch",
            "next_node_id": "post_purchase"
          }
        ]
      },
      "post_purchase": {
        "text": "You stand in the middle of the underground market. The three merchants watch you expectantly.",
        "options": [
          {
            "text": "Visit the goblin potion seller.",
            "flow": "dialogue_branch",
            "next_node_id": "goblin_stall"
          },
          {
            "text": "Visit the dwarf weapon seller.",
            "flow": "dialogue_branch",
            "next_node_id": "dwarf_stall"
          },
          {
            "text": "Visit the old woman selling secrets.",
            "flow": "dialogue_branch",
            "next_node_id": "secrets_stall"
          },
          {
            "text": "Head for the exit tunnel.",
            "flow": "close_encounter",
            "responseText": "You walk to the far tunnel and climb back to the surface. The market fades behind you like a half-remembered dream."
          }
        ]
      }
    }
  },
  {
    "id": "lore_045",
    "text": "You find a door standing upright in the middle of a meadow. There is no wall, no building, no frame. Just a door. It is painted red and has a brass knocker shaped like a fist.",
    "options": [
      {
        "text": "Open the door and walk through.",
        "result": "shortcut",
        "details": "clicks",
        "amount": 5,
        "responseText": "You step through the door and emerge in an entirely different part of the forest, miles ahead of where you were. You look back. There is no door. There is only forest."
      },
      {
        "text": "Knock on the door using the brass knocker.",
        "effect": "item",
        "details": "gold",
        "amount": 25,
        "responseText": "You knock three times. The door swings open and a leather pouch falls out of thin air, hits the ground, and spills gold coins. The door closes. No one answers."
      },
      {
        "text": "Walk around to the other side of the door.",
        "result": "none",
        "responseText": "The other side of the door looks exactly the same. Red paint, brass knocker. You walk around it three more times. It is a door. In a meadow. You accept this and move on."
      },
      {
        "text": "Kick the door down.",
        "result": "damage",
        "responseText": "The door does not budge. Your foot, however, does. It bends in a direction feet should not bend. The brass fist knocker seems to be laughing at you."
      }
    ]
  },
  {
    "id": "lore_046_harbor_portal",
    "text": "You reach a crumbling stone harbor at the edge of a lake. Three ancient boats are docked, each with a destination carved into its bow. A ferryman made entirely of mist stands at the dock, gesturing toward the vessels.",
    "options": [
      { "text": "The Moonstone Spires", "routeTitle": "Angkor_Wat" },
      { "text": "The Driftwood Citadel", "routeTitle": "Venice" },
      { "text": "The Salt Throne", "routeTitle": "Dead_Sea" },
      { "text": "The Ember Isles", "routeTitle": "Galápagos_Islands" },
      {
        "text": "Decline the ferryman's offer.",
        "result": "none",
        "responseText": "The ferryman dissolves into the mist without a word. The boats sink slowly into the lake. The harbor is empty."
      }
    ]
  },
  {
    "id": "lore_047",
    "text": "A weathered wooden barrel sits at the edge of the path. It is sealed with a cork and labeled 'DEFINITELY NOT BEES'. You can hear a faint buzzing from inside.",
    "options": [
      {
        "text": "Open the barrel.",
        "result": "damage",
        "responseText": "It was bees. It was always bees. You are stung repeatedly. The label was technically accurate in its inaccuracy."
      },
      {
        "text": "Roll the barrel down the hill.",
        "result": "none",
        "responseText": "The barrel rolls away, buzzing angrily. Somewhere in the distance, you hear it crash and then a lot of screaming. Not your problem."
      },
      {
        "text": "Carefully peek under the cork without removing it.",
        "result": "item",
        "details": "health",
        "responseText": "Through the tiny gap, you see not bees but a jar of honey sitting atop a pile of dead bees. You extract the honey. It is medicinal-grade and restores your health."
      },
      {
        "text": "Yell 'I KNOW YOU'RE BEES' at the barrel.",
        "result": "none",
        "responseText": "The buzzing stops. There is a brief silence. Then the buzzing resumes, louder and angrier. You walk away."
      }
    ]
  },
  {
    "id": "lore_048",
    "text": "You find a set of standing stones arranged in a triangle. In the center, a metal spike protrudes from the ground with three rings around it: gold, silver, and iron. Lightning flickers between the stones despite the clear sky. A plaque reads: 'Remove one ring. Choose wisely. Choose quickly.'",
    "options": [
      {
        "text": "Remove the gold ring.",
        "effect": "item",
        "details": "gold",
        "amount": 80,
        "responseText": "The gold ring slides off the spike easily. The lightning stops. The standing stones go dark. The ring is heavy and pure. You pocket it and its considerable value."
      },
      {
        "text": "Remove the silver ring.",
        "result": "item",
        "details": "shield",
        "responseText": "The silver ring hums as you pull it free. A protective aura wraps around you like a second skin. The lightning fades. Your defense increases."
      },
      {
        "text": "Remove the iron ring.",
        "result": "item",
        "details": "weapon",
        "responseText": "The iron ring is warm to the touch. As you remove it, energy crackles through your weapon. The edge gleams with latent force. Damage base increased by 1."
      },
      {
        "text": "Remove all three rings at once.",
        "result": "damage-major",
        "responseText": "Lightning from all three standing stones converges on the spike and detonates. You are launched thirty feet through the air. The rings are gone. So is most of your dignity."
      }
    ]
  },
  {
    "id": "lore_049_collapsed_library",
    "dialogueNodes": {
      "start": {
        "text": "You find a half-collapsed stone building. A faded sign above the entrance reads 'THE LIBRARY OF THREN'. Most of the ceiling is gone and books are scattered everywhere, many ruined by weather. A few shelves still stand inside, and you can see a staircase leading down to a lower level.",
        "options": [
          {
            "text": "Browse the surviving shelves.",
            "flow": "dialogue_branch",
            "next_node_id": "browse_shelves"
          },
          {
            "text": "Descend the staircase to the lower level.",
            "flow": "dialogue_branch",
            "next_node_id": "lower_level"
          },
          {
            "text": "Search through the scattered books on the floor.",
            "result": "none",
            "responseText": "Most of the books are waterlogged pulp. One appears to be a cookbook. The recipe for 'Dragon Flank Stew' is interesting but ultimately useless. You find nothing of value."
          },
          {
            "text": "Leave the library. You were never much of a reader.",
            "flow": "close_encounter",
            "responseText": "You turn away from the ruined library. Knowledge is overrated anyway."
          }
        ]
      },
      "browse_shelves": {
        "text": "Three books remain on the shelves, each with a distinct spine. One is bound in red leather with the title 'The Art of War, Abridged'. Another is blue with the title 'Healing Herbs of the Western Marches'. The third is black with no title at all.",
        "options": [
          {
            "text": "Read 'The Art of War, Abridged'.",
            "result": "item",
            "details": "weapon",
            "responseText": "The book contains exactly one page. It reads: 'Hit them before they hit you. Hit them harder than they hit you. Repeat.' Somehow, this obvious advice sharpens your combat instincts. Damage base increased by 1.",
            "flow": "dialogue_branch",
            "next_node_id": "post_shelves"
          },
          {
            "text": "Read 'Healing Herbs of the Western Marches'.",
            "result": "item",
            "details": "health-major",
            "responseText": "The book describes several herbs growing nearby that you had walked past without noticing. You gather them and prepare a crude but effective remedy. Your health is significantly restored.",
            "flow": "dialogue_branch",
            "next_node_id": "post_shelves"
          },
          {
            "text": "Read the black book with no title.",
            "result": "damage",
            "responseText": "The book is blank except for the last page, which reads 'You shouldn't have opened this.' The book snaps shut and a burst of dark energy hits you square in the chest. Lesson learned.",
            "flow": "dialogue_branch",
            "next_node_id": "post_shelves"
          },
          {
            "text": "Go downstairs instead.",
            "flow": "dialogue_branch",
            "next_node_id": "lower_level"
          }
        ]
      },
      "post_shelves": {
        "text": "You've examined the shelves. The staircase to the lower level still beckons.",
        "options": [
          {
            "text": "Descend to the lower level.",
            "flow": "dialogue_branch",
            "next_node_id": "lower_level"
          },
          {
            "text": "Leave the library.",
            "flow": "close_encounter",
            "responseText": "You've had enough of this library. You step back into the daylight."
          }
        ]
      },
      "lower_level": {
        "text": "The lower level is surprisingly intact. Stone walls keep the weather out. In the center of the room is a pedestal with a glass case. Inside the case is a single scroll. The case has no visible lock or latch. A brass plate on the pedestal reads: 'To open, answer: What has keys but no locks, space but no room, and you can enter but cannot go inside?'",
        "options": [
          {
            "text": "'A keyboard.'",
            "effect": "item",
            "details": "gold",
            "amount": 100,
            "responseText": "The glass case dissolves into thin air. You unroll the scroll. It's a deed to a forgotten treasury, with directions to a cache buried nearby. You dig where indicated and find a chest of gold. The Library of Thren delivers.",
            "flow": "close_encounter"
          },
          {
            "text": "'A map.'",
            "result": "none",
            "responseText": "The glass case does not open. The brass plate seems to sigh. That is not the answer.",
            "flow": "dialogue_branch",
            "next_node_id": "lower_level"
          },
          {
            "text": "'A house.'",
            "result": "none",
            "responseText": "Nothing happens. The pedestal remains sealed. The scroll taunts you from behind the glass.",
            "flow": "dialogue_branch",
            "next_node_id": "lower_level"
          },
          {
            "text": "Smash the glass case.",
            "result": "damage-major",
            "responseText": "The glass explodes outward with tremendous force, shredding the scroll and peppering you with shards. The pedestal crumbles. Whatever was on that scroll is gone forever. So is a fair amount of your health.",
            "flow": "close_encounter"
          }
        ]
      }
    }
  }
]
